#14η Άσκηση.
# Ο χρήστης δίνει την αρχή και το τέλος του διαστήματος, καθώς και έναν ακέραιο.
begin = int(input("Give start of interval: "))
end = int(input("Give end of interval: "))
integer = int(input("Give integer: "))
i = begin
b = 0
c = 0
# Ξεκινάει η επανάληψη while από την αρχή του διαστήματος.
while i <= end:
    a = 0
# Ελέγχεται αν ο αριθμός i είναι μεγαλύτερος του 1 και αν είναι πρώτος. Αν δεν είναι μεγαλύτερος του 1, η εκτέλεσ προχωρά στο τελευταίο else, οπού το i αυξάνεται κατά 1.
    if i > 1:
        for j in range(2, i - 1):
            if (i % j) == 0:
                a = 1
                break
# Εαν ο αριθμός i είναι πρώτος, ελέγχεται αν ο αριθμός k είναι πρώτος, προκειμένου να βρεθεί ο 2ος πρώτος αριθμός. Εαν ο αριθμός i δεν είναι πρώτος, το πρόγραμμα δεν εισερχεται στην συνθήκη και η επανάληψη τελειώνει με την πρόσθεση +1 στον i.
        if a == 0:
            for k in range(i + 1, end+1):
                flag = 0
                for w in range(2, k - 1):
                    if (k % w) == 0:
                        flag = 1
                        break
                if flag == 0:
                    b = k
                    break
# Εαν υπάρχει αριθμός k πρώτος, ελέγεται αν το |i-k| είναι ίσο με τον ακεραιο που δώθηκε στην αρχή. Αν ισχύει, το πρόγραμμμα θα τερματίσει, αλλιώς, το i θα αυξηθεί κατά 1 και το πρόγραμμα θα επαναληφθεί απο το while.
            if a == 0:
                if abs(i - b) == integer:
                    print("The two numbers are", i, "and", b)
                    i = (end + 1)
                    c = 1
                else:
                    i += 1
        else:
            i += 1
    else:
        i += 1
# Εαν η επανάληψη του while ολοκληρωθεί και δεν έχει βρεθεί το ζητούμενο, ο χρήστης ενημερώνεται γι 'αυτό.
if c == 0:
    print("No numbers with the desired condition were found.")




                       



